<details><summary>Digger run report at 2024-12-31 11:39:27 (UTC)</summary>
      <details><summary>Locking successful</summary>
  Project xctions/custom-actions-test#production has been locked by PR #2
</details>

<details><summary>Plan for <b>xctions/custom-actions-test#production</b></summary>
  
```terraform
Terraform will perform the following actions:

  # local_file.file1 will be created
  + resource "local_file" "file1" {
      + content              = "okok2"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "644"
      + filename             = "file1.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (production)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>